package homeworks.java.cosmo.string;

import javax.swing.*;
import java.sql.SQLOutput;

/**
 * Создайте программу,
 * которая на вход получает строку “Мама мыла Милу мылом!” и выводит её в обратном порядке.
 * Мама мыла Милу мылом! -> !молым улим алым амаМ
 * <p>
 * Подсказка: используйте метод .reverse() класса StringBuilder
 */
public class ExB {
    public static void main(String[] args) {
        String input = "Мама мыла Милу мылом!";
        StringBuilder input1 = new StringBuilder(input);

        System.out.println(input1.reverse());

    }
}